package com.ethiopia.app.jokes.Fragments;

import android.os.Bundle;
import android.support.v4.app.Fragment;
import android.support.v7.widget.LinearLayoutManager;
import android.support.v7.widget.RecyclerView;
import android.view.LayoutInflater;
import android.view.View;
import android.view.ViewGroup;

import com.ethiopia.app.jokes.R;
import com.ethiopia.app.jokes.Recycler.Jokes;
import com.ethiopia.app.jokes.Recycler.MyRecyclerAdapter;

import java.util.ArrayList;

/**
 * Created by tibsolg on 2/21/2017.
 */
public class Amh_Working_Jokes extends Fragment {

    public View onCreateView(LayoutInflater inflater,ViewGroup container,Bundle savedInstanceState){

        View v=inflater.inflate(R.layout.amh_working_joks,null);
        RecyclerView rv=(RecyclerView)v.findViewById(R.id.mRecyclerWork);
        rv.setLayoutManager(new LinearLayoutManager(this.getActivity()));
        rv.setAdapter(new MyRecyclerAdapter(this.getActivity(),getWorkJokes()));

        return v;
    }

    private ArrayList<Jokes> getWorkJokes() {
        ArrayList<Jokes>joke=new ArrayList<>();
        Jokes jokes=new Jokes("ዘመነኛ አባባል ice","1) ሰርገኛ መጣ ማን ጠራው??\n" +
                "2) የትም ፍጪው ግን ወፍጮ ቤት ይሁን\n" +
                "3) ስራ ያጣ መነኩሴ ማስታቂያ ያነባል(ኦቨር\n" +
                "ታይም ይቀድሳል)\n" +
                "4) የወጋ ቢረሳ የተወጋ ሆስፒታል ይገባል\n" +
                "5) ሰውን ማመን ቀብድ ተቀብሎ ነው\n" +
                "6) ላም አለኝ በሰማይ አዉሮፕላን ገጫት\n" +
                "7) ተልባ ሲንጫጫ ኑግ ደነገጠ\n" +
                "8) ማን አምሽ አለዉ ካመሸ ሌባ ነው\n" +
                "9) አስቂኝ ፌስቡክ ፕሮፋይል ፒክቸሮች ላይክ\n" +
                "አደረኩ ብሎ ሸር አደረገው\n" +
                "10) ዶሮን ሲያታሉላት ነቃችባቸው\n" +
                "11) ሚዳቋ ዘላዘላ ደከማት\n" +
                "12) ሌባ ላመሉ የራሱ መስሎት የሰው ኪስ\n" +
                "ይገባል\n" +
                "13) ድመት መንኩሣ ገዳም ገባች አሉ\n" +
                "14) የነ ቶሎ ቶሎ ቤት ቀበሌ አፈረሰው");
        joke.add(jokes);

        jokes=new Jokes("ሠራተኛ....እንደ ቻንድራ","ከእለታት አንድ ቀን የፉብሪካ ባለቤት የሆነ አንድ ሰውዬ ወደ ህንድ አገር ይሄዳል::እዚያ እንደደረሰም የሒንዱ አምላክ የሆነችው የቻንድራን መታሰቢያ ሐውልት ይመለከታል::ስድስት እጆች ያሉትን የሴት ቅርስ ያየው ሰውየው ነጋዴ በቻንድራ እጆች ብዛት ስለተማረከ ወደ አስጐብኚው ዘውር ብሎ  <<ለፉብሪካዬ መቅጠር የምፈልገው እንደሷ አይነት ሰራተኞችን ነው>>አለ");
        joke.add(jokes);

        jokes=new Jokes("ጉራጌ","አበባ ጠንክር ፱፮ አመታቸው ነው አና ሊሞቱ እየተጠበቁ ነው። በድንግት ልጆችና ልጅ ልጆቻቸውን መጥራት ጀመሩ። “አሽራፍ?”... “ አለሁ አባባ”... “ደንድርና ትግስቶ”... “አለን አባብዬ”... “ዘበርጋ?” እሱም እዚህ ነው። “የወንድሞቼ ልጆች?” እዚህ ናቸው...የእህቶቼ ልጆችሽ... “አባባ ሁላችንም እዚህ ነን”.... “እንዴ? ታድያ ማነው ሱቁን የሚጠብቀው?”");
        joke.add(jokes);

        jokes=new Jokes("ነገረኛው ወያላ","የታክሲ ወያላ ፤ ታክሲው ሞልቶ መንገድ እንደጀመረ ከጎኑ የተቀመጡት ተሳፋሪ በድንገት ሆዳቸው መጮህ ይጀምራል፤ ወያላዉም፤ ትንሽ ካዳመጠ በኋላ፤ ወደ ተሳፋሪው ጠጋ ብሎ ፤ ጋሼ የእጅ፤ ስልክዎ ፤ ይጮሃል ፤ አላቸው።");
        joke.add(jokes);

        jokes=new Jokes("እብዱ","አማኑኤል ሆስፒታል ውስጥ አንዱ እብድ ፎቶ ግድግዳ ላይ ለመስቀል ፈልጎ ሚስማሩን ገልብጦ በመዶሻ ግድግዳው ላይ ለመምታት ይታገላል:: አንድ ሌላ እብድ ባጠገቡ ሲያልፍ ያየውና በሳቅ ይሞታል:: ይሄኛው እብድ ” ምን ያስቅሃል ይለዋል? እሱም “ዝም ብለህ ትለፋለህ የያዝከው ሚስማር እኮ የተሰራው ለዛኛው ግድግዳ ነው” ብሎ የሚስማሩ ጫፍ ወደሚያሳይበት ግድግዳ አሳየው::");
        joke.add(jokes);

        jokes=new Jokes("ከአልጋ ላይ ወድቄ ነው","አለቃ አንድ ቀን መንገድ መሽቶባቸው አንዲት ሴትዮ ቤት እንድታሳድራቸው ለምነው ቤት ለእንግዳ ብላ አስገባቻቸው። አለቃ ያው እንደሚተረከው ቅንዝራም ቢጤ ናቸው። እራት በልተው ከጨረሱ በኋላ በሉ እኔ መደብ ላይ እርሶ መሬት ላይ ተኙ ብላቸው ተኙ። ከዚያ ጨለማን ተገን በማድረግ ሴትየዋ መደብ ላይ ዘፍ ብላው መዳሰስ ይጀምራሉ። ሴትየዋም በድንጋጤ ነቅታ እንዴ ምን እየሰሩ ነው ስትላቸው ከአልጋ ላይ ወድቄ ነው አሏት። እንዴት መሬት ተኝተው ስትላቸው እኔንስ የገረመኝ እሱ አይደል አሏት ይባላል");
        joke.add(jokes);

        jokes=new Jokes("ዘበኛው ዶክተር","በአንድ ክሊኒክ ውስጥ ዶክተሩ ለምሳ\n" +
                "ይወጣና ለዘበኛው ያስጠብቀዋል!\n" +
                "- -- -- -- -- -- -- -- -- -- -- -\n" +
                "- -- -- -- -- -- -- -- -- -- -- -\n" +
                "ዶክተሩ: ታካሚ ከመጣ ትንሽ ጠብቁ ዶክተሩ\n" +
                "ይመጣል በላቸው (ዶክተሩ እንደ ቀልድ)\n" +
                "የምትቸለውንም አስተናግድ!\n" +
                "ዘበኛው: እሺ !\n" +
                "ከ 1 ሰአት በኃላ.........\n" +
                "ዶክተሩ: ሰው መጥቶ ነበር ?\n" +
                "\n" +
                "ዘበኛው: አዎ አንዱ ራስ ምታት አሞኝ ነው\n" +
                "ሲል (parastamol) ሰጠሁት!\n" +
                "ዶክተሩ: ጎበዝ ሌላስ ?\n" +
                "ዘበኛው: አንዷ መጥታ እየሮጠች አልጋው ላይ\n" +
                "ተኛች!\n" +
                "ዶክተሩ: ከዛስ (በድንጋጤ እያየው......)\n" +
                "ዘበኛው: ከዛ...... ሙሉ ልብሷን አውልቃ ለ15\n" +
                "አመት አንድም ቀን ወንድ አይቼ አላውቅም\n" +
                "አለችኝ!\n" +
                "ዶክተሩ: ከዛስ (አሁንም በድንጋጤ እያየው..)\n" +
                "ዘበኛው: ያው ለ15 አመት አንድም ቀን ወንድ\n" +
                "አይታ ስለማታውቅ......\n" +
                "- -- -- -- -- -- -- -- -- -- -- -\n" +
                "- -- -- -- -- -- -- -- -- -- -- -\n" +
                "- -- -- -- -- -- -- -- -- -- -- -\n" +
                "አይኗ ላይ የአይን ጠብታ አደረኩላት!\n" +
                "- -- -- -- -- -- -- -- -- -- -- -\n" +
                "ወንዶች በዘበኛው ቦታ ብትሆኑ ምን\n" +
                "ታደርጋላችሁ ?");
        joke.add(jokes);

        jokes=new Jokes("ፖሊሱና መፅሀፍ ቅዱሱ","መቼ ለት ከታክሲ ስወርድ የኪስ ቦርሳዬን ጥዬ ስለወረድኩ\n" +
                "መታወቅያዬ እና መንጃ ፍቃዴ ተሰውረውብኝ ተቸግሬ ነው\n" +
                "የከረምኩት፡፡ አዲስ ለማውጣትም ስሄድ ከፖሊስ ጣብያ ማፃፍ\n" +
                "እንዳለብኝ ስለተነገረኝ ባቅራብያዬ ወደሚገኘው ፖሊስ ጣብያ\n" +
                "\n" +
                "አመራሁ፡፡ ጣብያ ውስጥ ተፈትሼ ከገባሁ በኋላ መጀመርያ\n" +
                "ያገኘሁት የፖሊስ አባል ወንበሩን አውጥቶ ፀሀይ እየሞቀ\n" +
                "መፅሀፍ ቅዱስ ሲያነብ በማግኘቴ በጣም ነበር የገረመኝ፤ ደስም\n" +
                "አለኝ… በየጊዜው በክፉ ሲታሙ የምንሰማቸው የሀገራችን\n" +
                "ፖሊሶች አምላክን ቢጠጉልንማ መልካም ነው ብዬ ለራሴ\n" +
                "አሰብኩና ፤ የፖሊሱን የመፅሀፍ ቅዱስ እውቀት እግረመንገዴን\n" +
                "ልፈትን ፈለኩ፡፡ አቀርቅሮ ቅዱሱን መፅሀፍ ከሚያነበው ፖሊስ\n" +
                "ጠጋ አልኩና “ወንድሜ ለመሆኑ የአዳምን ልጅ፤ አቤልን ፤ ማን\n" +
                "እንደገደለው ታውቃለህ?” ብዬ የመጀመርያ ጥያቄዬን\n" +
                "አቀረብኩለት፡፡ ፖሊሱም ለአፍታም ቀና ሳይል በእጁ ዞር\n" +
                "እንድልለት ምልክት እየሰጠኝ “እኔ የት አውቅልሀለሁ፤ ሂድና\n" +
                "ሳጅን እያሱን ጠይቀው እሱ ነው የነብስግድያ መዝገቦችን\n" +
                "የሚከታተለው ብሎኝ እርፍ፡፡");
        joke.add(jokes);

        jokes=new Jokes("ሰባተኛ ፎቅ","ሰውየው ሰባተኛ ፎቅ በረንዳ ላይ ሆኖ ንፋስ ይቀበላል። አካባቢውን እየቃኘ እያለ አንድ ሰው ምድር ላይ ሆኖ እጁን ሲያውለበልብለት ይመለከታል።\n" +
                "\" +\n" +
                "                \"በድምፅ መደማመጥ ስላልቻሉ ምድር ያለው ሰውዬ ሰባተኛ ፎቅ ላይ ያለውን ሰውዬ በምልክት 'ና' ይለዋል።\\n\" +\n" +
                "                \"ሰባተኛ ፎቅ ላይ የነበረው ሰውዬ ስለሰውዬው ማንነትና ስለፈለገው ነገር እያሰበ ከፎቁ ይወርዳል። የምድሩ ሰውዬ ጋር እንደደረሰም:\\n\" +\n" +
                "                \"ፎቅ ላይ የነበረው: \\\"አቤት ወንድሜ ምን ፈልገህ ነው?\\\"\\n\" +\n" +
                "                \"ምድር ላይ ያለው: ፊቱን አሳዛኝ ካደረገ በኋላ \\\"ይቅርታ ጌታዬ አለፋሁዎት አይደል? ለማኝ ነኝ። እስኪ ስለ እግዚአብሔር ብለው ያለዎትን ይመፅውቱኝ\\\"\\n\" +\n" +
                "                \"ሲለው ሰውየው ከሰባት ፎቅ ድረስ በቁም ነገር ወርዶ በሰማው ነገር እጅግ ስለተበሳጨ ለማኙን ካልገደልኩ ብሎ አስቸገረ።\\n\" +\n" +
                "                \"ትርምሱ በአገላጋዮች ከረገበ በኋላ ለማኙ ላይ እየዛተ ወደነበረበት ፎቅ ይመለሳል።\\n\" +\n" +
                "                \"እየተመለሰ እያለ ግን ለማኙ የምሩን ተቸግሮስ ቢሆን እያለ እያሰበ ነበር።\\n\" +\n" +
                "                \"መጀመሪያ የነበረበት ሰባተኛ ፎቅ ላይ ደርሶ ወደታች ሲመለከት ለማኙ አሁንም አንጋጦ ሲመለከተው ያያል።\\n\" +\n" +
                "                \"ተስፋ ቆርጦ በረጅሙ ከተነፈሰ በኋላ ያፏጭና ለማኙን ይጠራዋል።\\n\" +\n" +
                "                \"ለማኙ በደስታ እየተፍነከነከና የሰውዬውን ልብ ያራራለትን አምላክ እያመሰገነ ሰባተኛ ፎቅ ከወጣ በኋላ:\\n\" +\n" +
                "                \"ምድር የነበረው (ለማኙ): እየተቅለሰለሰ \\\"አቤት የኔ ጌታ?\\\" ቢለው\\n\" +\n" +
                "                \"ፎቅ ላይ ያለው (ተለማኝ): \"እግዚአብሔር ይስጥልኝ!!!\" ብሎት እርፍ!!!");
        joke.add(jokes);

        jokes=new Jokes("ለፈገግታ","ሴትዮዋ በቀይ ፈንታ አረንጓዴ ልፕስቲክ ተቀብታ ወደ ገበያ ስታቀና ያዩዋት ሰዎች ሁሉ ምነው ሴትዬዋ አበደች እንዴ እያሉ ይስቁባታል።በዚህ ሁኔታ ብዙ ሰዎችን ካሳለፈች ቡኃላ የሚያውቋት ሰዎች ሲያይዋት ከንፈርዋን አረንጓዴ ቀለም ነው የተቀባችው ባሏ ደግሞ ሹፌር ነው።ሰዎቹም ምነው ይኅንን አረንጓዴ ቀለም ልፕስቲክ ተቀባሽ??ስው እኮ የሚስቅብሽ ቀይ ልፕስቲክ መቀባት ነበረባት እያለ ነው ሲሏት እሷም ቀበል አድርጋ ባለቤቴ ሾፌር ስለሆነ የተከለከለ እንዳይመስለው ነው። :D አለች ይባላል\n" +
                "\"\n"+
                " \"« ምንጭ አቶ ይድነቃቸው ተሰማ ከዛሬ 25 ዓመት በፊት ለእኍድ የሬድዮ መዝናኛ ካቀረቡት ተብሎ በ ቪ ኦ ኤ የሰማሁት ነው »\n" +
                " \"\n");
        joke.add(jokes);

        jokes=new Jokes("Chocolate","we have To work tell and of die");
        joke.add(jokes);

        return joke;
    }

    public String toString(){
        return "የስራ ቀልዶች";
    }
}
